<!DOCTYPE html><html class="no-js"><head><meta charset="utf-8"><title>司马-Simmer-我的2016</title><meta name="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1"><link rel="icon" href="/favicon.icon"><link rel="stylesheet" href="/css/style.css"><!-- detech broser's env --><script src="/js/modernizr.js" type="text/javascript"></script><meta name="description" content="A Blog Powered By Hexo"></head><body><div class="nav clearfix"><div title="隐藏导航" id="nav-btn" class="nav-guide"><i class="icon nav-icon">&#xe603;</i></div><div class="nav-inner  clearfix"><a href="/" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe606;</div><span>Home</span></div></a><a href="/archives" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe602;</div><span>Archives</span></div></a><a href="/categories" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe604;</div><span>Categorys</span></div></a><a href="/tags" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe601;</div><span>Tags</span></div></a><a href="/about" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe605;</div><span>About</span></div></a></div></div><div class="wraper"><div class="main"><section class="content"><div class="post"><article class="post-block"><h2 class="post-title"><a href="/2016/12/29/other/summary-about-2016/" class="post-title-link">我的2016</a></h2><div class="post-subtitle clearfix"><span class="post-date">2016年12月29日</span><div class="post-tag"><a href="/2016/12/29/other/summary-about-2016/"><sapn>life</sapn><i class="icon">&#xe600;</i></a></div></div><div class="post-content"><div class="toc">

<!-- toc -->
<ul>
<li><a href="#bi-ye-she-ji">&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;</a></li>
<li><a href="#zhao-gong-zuo">&#x627E;&#x5DE5;&#x4F5C;</a></li>
<li><a href="#bi-ye-liao">&#x6BD5;&#x4E1A;&#x4E86;</a></li>
<li><a href="#gong-zuo">&#x5DE5;&#x4F5C;</a></li>
<li><a href="#gong-zuo-ri-chang">&#x5DE5;&#x4F5C;&#x65E5;&#x5E38;</a></li>
<li><a href="#jie-yu">&#x7ED3;&#x8BED;</a></li>
</ul>
<!-- tocstop -->
<p></div><br>&#x4ECA;&#x5929;&#x50CF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#x5728;&#x7F51;&#x4E0A;&#x4E71;&#x901B;&#xFF0C;&#x65E0;&#x610F;&#x4E2D;&#x53D1;&#x73B0;&#x4E86;&#x962E;&#x4E00;&#x5CF0;&#x5148;&#x751F;&#x5199;&#x7684;<a href="http://www.ruanyifeng.com/blog/2016/12/year_summary.html" target="_blank" rel="external">2016&#x5E74;&#x7684;&#x603B;&#x7ED3;</a>&#xFF0C;&#x4F5C;&#x4E3A;&#x5F53;&#x5E74;&#x5927;&#x5B66;&#x65F6;&#x4EE3;&#x552F;&#x4E00;&#x4E00;&#x4F4D;&#x5F7B;&#x5934;&#x5F7B;&#x5C3E;&#x4EF0;&#x671B;&#x7684;&#x6280;&#x672F;&#x5927;&#x725B;&#xFF0C;&#x962E;&#x4E00;&#x5CF0;&#x5148;&#x751F;&#x7684;&#x535A;&#x5BA2;&#x662F;&#x6211;&#x83B7;&#x53D6;&#x77E5;&#x8BC6;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x6765;&#x6E90;&#x3002;&#x4ED6;&#x7684;2016&#x5E74;&#x53C8;&#x662F;&#x8F89;&#x714C;&#x7684;&#x4E00;&#x5E74;&#xFF0C;Github&#x7C89;&#x4E1D;&#x7834;&#x4E07;&#xFF0C;&#x51FA;&#x7248;&#x4E86;&#x65B0;&#x4E66;&#x300A;ES6&#x6807;&#x51C6;&#x5165;&#x95E8;&#x300B;&#xFF08;&#x7B2C;&#x4E8C;&#x7248;&#xFF09;&#xFF0C;&#x4E2A;&#x4EBA;&#x53D1;&#x5E03;&#x4E86;&#x51E0;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;start&#x5747;&#x7834;&#x5343;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x7AD9;&#x5728;&#x73B0;&#x5728;&#x7684;&#x65F6;&#x95F4;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x56DE;&#x987E;&#x6211;&#x7684;2016&#x5E74;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5728;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x8FDB;&#x6B65;&#x771F;&#x7684;&#x662F;&#x5F88;&#x5C0F;&#xFF0C;&#x8FD9;&#x91CC;&#x8BB0;&#x5F55;&#x4E0B;&#x6211;&#x7684;2016&#x5E74;&#x5EA6;&#x603B;&#x7ED3;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8FC7;&#x53BB;&#x6709;&#x4E2A;&#x4EA4;&#x4EE3;&#xFF0C;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x671F;&#x671B;&#xFF0C;&#x552F;&#x613F;&#xFF0C;&#x52FF;&#x5FD8;&#x521D;&#x5FC3;&#x3002;<br><a id="more"></a></p>
<h2 id="bi-ye-she-ji"><a href="#&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;" class="headerlink" title="&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;"></a>&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1; <a href="#bi-ye-she-ji" class="header-anchor">#</a></h2><p>&#x5E74;&#x540E;&#x56DE;&#x6765;&#x7684;&#x5927;&#x56DB;&#x4E0B;&#x5B66;&#x671F;&#xFF0C;&#x51E0;&#x4E4E;&#x65F6;&#x95F4;&#x90FD;&#x7528;&#x5728;&#x4E86;&#x505A;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;&#x4E0A;&#x3002;&#x548C;&#x5927;&#x5B66;&#x54E5;&#x4EEC;&#x513F;&#x4E00;&#x8D77;&#x5408;&#x4F5C;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x6211;&#x8D1F;&#x8D23;&#x8F6F;&#x4EF6;&#x4ED6;&#x8D1F;&#x8D23;&#x786C;&#x4EF6;&#xFF0C;&#x505A;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7269;&#x8054;&#x7F51;&#x5BB6;&#x5C45;&#xFF0C;&#x901A;&#x8FC7;&#x624B;&#x673A;APP&#x8FDE;&#x63A5;Wi-Fi&#x6765;&#x63A7;&#x5236;&#x5BB6;&#x4E2D;&#x7684;&#x706F;&#x5149;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x540D;&#x8FD8;&#x6CA1;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#x7684;&#x524D;&#x7AEF;&#x6765;&#x8BF4;&#xFF0C;javascript&#x90FD;&#x6CA1;&#x5B66;&#x4F1A;&#x591A;&#x5C11;&#xFF08;&#x5176;&#x5B9E;&#x73B0;&#x5728;&#x4E5F;&#x4E0D;&#x600E;&#x4E48;&#x4F1A;&#xFF09;&#xFF0C;&#x8DD1;&#x53BB;&#x7528;Java&#x5199;&#x624B;&#x673A;APP&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#x4E00;&#x5F00;&#x59CB;&#x6211;&#x662F;&#x62D2;&#x7EDD;&#x7684;&#xFF0C;&#x5F53;&#x65F6;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x6162;&#x6162;&#x78E8;&#x8E6D;&#x554A;&#xFF0C;&#x4E00;&#x4F1A;&#x5012;&#x817E;&#x524D;&#x7AEF;&#x4E00;&#x4F1A;&#x770B;&#x770B;Java&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x865A;&#x5EA6;&#x4E86;&#x5FEB;&#x5927;&#x534A;&#x5E74;&#x7684;&#x5149;&#x9634;&#xFF0C;&#x73B0;&#x5728;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x771F;&#x7684;&#x662F;&#x592A;&#x4E0D;&#x503C;&#x5F97;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD8;&#x662F;&#x5F88;&#x611F;&#x8C22;&#x6211;&#x7684;&#x5BFC;&#x5E08;&#x4F20;&#x4E91;&#x54E5;&#xFF0C;&#x8FD8;&#x6709;&#x548C;&#x6211;&#x4E00;&#x8D77;&#x5B8C;&#x6210;&#x6BD5;&#x8BBE;&#x7684;&#x554A;&#x6797;&#x3002;&#x8FD9;&#x534A;&#x5E74;&#x867D;&#x7136;&#x5B66;&#x4E60;&#x6548;&#x7387;&#x4E0D;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x81F3;&#x5C11;&#x4E5F;&#x73A9;&#x5230;&#x4E86;&#x4E5F;&#x4E0D;&#x662F;&#xFF01;</p>
<h2 id="zhao-gong-zuo"><a href="#&#x627E;&#x5DE5;&#x4F5C;" class="headerlink" title="&#x627E;&#x5DE5;&#x4F5C;"></a>&#x627E;&#x5DE5;&#x4F5C; <a href="#zhao-gong-zuo" class="header-anchor">#</a></h2><p>&#x5728;&#x627E;&#x5DE5;&#x4F5C;&#x8FD9;&#x5757;&#xFF0C;&#x81EA;&#x4ECE;&#x53BB;&#x5E74;&#x963F;&#x91CC;&#x7684;&#x6821;&#x62DB;&#x7F29;&#x62DB;&#xFF0C;&#x5E2D;&#x5377;&#x4E86;&#x4E00;&#x5927;&#x6CE2;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x6821;&#x62DB;&#x5BD2;&#x6F6E;&#x3002;&#x53BB;&#x5E74;&#x5927;&#x4E09;&#x7684;&#x79CB;&#x62DB;&#x6295;&#x4E86;&#x767E;&#x5EA6;&#x3001;&#x963F;&#x91CC;&#x4F01;&#x9E45;&#xFF0C;&#x5176;&#x4E2D;&#x963F;&#x91CC;&#x4E00;&#x9762;&#x6302;&#xFF0C;&#x767E;&#x5EA6;&#x7B14;&#x8BD5;&#x6302;&#xFF0C;&#x4F01;&#x9E45;&#x6295;&#x9519;&#x5C97;&#x6CA1;&#x53BB;&#x53C2;&#x52A0;&#x7B14;&#x8BD5;&#x3002;&#x3002;&#x3002;&#x60F3;&#x7740;&#x4E5F;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x57FA;&#x7840;&#x8FD8;&#x6CA1;&#x6709;&#x6253;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x5B9E;&#x4E60;&#x7ECF;&#x9A8C;&#xFF0C;&#x7D22;&#x6027;&#x5728;&#x53BB;&#x5E74;&#x5BD2;&#x5047;&#x5728;&#x5357;&#x660C;&#x627E;&#x4E86;&#x4E00;&#x5BB6;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x5B9E;&#x4E60;&#xFF0C;&#x9762;&#x8BD5;&#x7684;&#x662F;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5C97;&#x4F4D;&#xFF0C;&#x53EF;&#x662F;&#x611F;&#x89C9;&#x5C31;&#x662F;&#x9875;&#x9762;&#x91CD;&#x6784;&#x4ED4;&#xFF08;&#x867D;&#x7136;&#x73B0;&#x5728;&#x4E5F;&#x662F;&#xFF5E;&#x7B11;&#xFF09;&#x3002;200&#x53F7;&#x4EBA;&#x7684;&#x5C0F;&#x516C;&#x53F8;&#xFF0C;&#x6211;&#x770B;&#x4E86;&#x4E0B;&#x9879;&#x76EE;&#x7684;&#x524D;&#x7AEF;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5404;&#x79CD;&#x8865;&#x4E01;&#xFF0C;&#x5404;&#x79CD;&#x7248;&#x672C;&#x7684;jQuery&#xFF0C;&#x5F53;&#x65F6;&#x770B;&#x5230;&#x4EE3;&#x7801;&#x6211;&#x662F;&#x62D2;&#x7EDD;&#x7684;&#x3002;&#x3002;&#x3002;&#x671F;&#x95F4;&#x5C31;&#x662F;&#x5404;&#x79CD;&#x5751;&#x5404;&#x79CD;&#x5751;&#x7239;&#xFF0C;&#x5446;&#x4E86;2&#x4E2A;&#x534A;&#x6708;&#x521A;&#x597D;&#x5FD9;&#x7740;&#x6BD5;&#x8BBE;&#x5C31;&#x8F9E;&#x4E86;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x60F3;&#x6765;&#x4E5F;&#x7684;&#x786E;&#x5F88;&#x611F;&#x8C22;&#x81EA;&#x5DF1;&#x8FD9;&#x6BB5;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5149;&#xFF0C;&#x4E3A;&#x6211;&#x540E;&#x9762;&#x9762;&#x8BD5;&#x7F51;&#x6613;&#x6253;&#x4E0B;&#x4E86;&#x57FA;&#x7840;&#x3002;&#x4ECA;&#x5E74;4&#x6708;&#x4EFD;&#xFF0C;&#x4E00;&#x6B21;&#x5076;&#x7136;&#x7684;&#x673A;&#x4F1A;&#x83B7;&#x5F97;&#x4E86;&#x7F51;&#x6613;&#x7684;&#x5185;&#x63A8;&#x673A;&#x4F1A;&#xFF0C;&#x5F53;&#x65F6;&#x4E5F;&#x6CA1;&#x591A;&#x60F3;&#x5C31;&#x5BF9;&#x81EA;&#x5DF1;&#x8BF4;&#x5C3D;&#x529B;&#x5C31;&#x597D;&#xFF0C;&#x540E;&#x9762;&#x7B14;&#x8BD5;&#x901A;&#x8FC7;&#x53BB;&#x5230;&#x676D;&#x5DDE;&#x73B0;&#x573A;&#x9762;&#x8BD5;&#xFF0C;&#x4E00;&#x8DEF;&#x4E0A;&#x4E5F;&#x662F;&#x98CE;&#x96E8;&#x65E0;&#x963B;&#x7684;&#x901A;&#x8FC7;&#x4E86;&#x6240;&#x6709;&#x7684;&#x9762;&#x8BD5;&#xFF0C;&#x6210;&#x529F;&#x7684;&#x62FF;&#x5230;&#x4E86;offer&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x73B0;&#x5728;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x8BB0;&#x5F97;&#x5F53;&#x65F6;&#x9762;&#x8BD5;&#x662F;&#x63D0;&#x524D;&#x4E00;&#x5929;&#x5230;&#x7684;&#x676D;&#x5DDE;&#xFF0C;&#x665A;&#x4E0A;&#x4E00;&#x76F4;&#x5728;&#x590D;&#x4E60;&#xFF0C;&#x4E3A;&#x7B2C;&#x4E8C;&#x5929;&#x7684;&#x9762;&#x8BD5;&#x505A;&#x51C6;&#x5907;&#x3002;&#x8981;&#x62FF;&#x5230;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x5B9E;&#x529B;&#xFF0B;&#x8FD0;&#x6C14;&#xFF0B;&#x4E34;&#x573A;&#x53D1;&#x6325;&#x90FD;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x800C;&#x6211;&#x5F88;&#x5E86;&#x5E78;&#x81EA;&#x5DF1;&#x90FD;&#x6709;&#x7740;&#x4E0D;&#x9519;&#x7684;&#x8868;&#x73B0;&#x3002;&#x9664;&#x53BB;&#x5B9E;&#x4E60;&#x4E4B;&#x5916;&#xFF0C;&#x7B97;&#x662F;&#x62FF;&#x5230;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6B63;&#x5F0F;&#x7684;offer&#xFF0C;&#x7EC8;&#x4E8E;&#x5728;&#x6700;&#x540E;&#x65F6;&#x523B;&#x642D;&#x4E0A;&#x4E86;&#x5927;&#x5382;&#x7684;&#x8F66;&#xFF01;</p>
<h2 id="bi-ye-liao"><a href="#&#x6BD5;&#x4E1A;&#x4E86;" class="headerlink" title="&#x6BD5;&#x4E1A;&#x4E86;"></a>&#x6BD5;&#x4E1A;&#x4E86; <a href="#bi-ye-liao" class="header-anchor">#</a></h2><p>&#x6BD5;&#x4E1A;&#x4E86;&#xFF0C;&#x6216;&#x591A;&#x6216;&#x5C11;&#x4F1A;&#x6709;&#x4E9B;&#x611F;&#x6168;&#xFF0C;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x6000;&#x5FF5;&#x9AD8;&#x4E2D;&#xFF0C;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x53C8;&#x8981;&#x53BB;&#x6000;&#x5FF5;&#x5927;&#x5B66;&#xFF0C;&#x4EBA;&#x8FD9;&#x4E00;&#x751F;&#xFF0C;&#x603B;&#x662F;&#x5728;&#x5FD9;&#x7740;&#x6000;&#x5FF5;&#x8FC7;&#x53BB;&#x3002;&#x5370;&#x8C61;&#x4E2D;&#x6CA1;&#x6709;&#x6700;&#x540E;&#x4E00;&#x5802;&#x8BFE;&#x7684;&#x62CD;&#x7167;&#x7559;&#x5FF5;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x79BB;&#x522B;&#x662F;&#x7684;&#x4F24;&#x611F;&#x79BB;&#x522B;&#xFF0C;&#x4E58;&#x7740;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x6CE8;&#x610F;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x4E2A;&#x4EBA;&#x6084;&#x6084;&#x7684;&#x6536;&#x62FE;&#x4E1C;&#x897F;&#x56DE;&#x4E86;&#x5BB6;&#x3002;&#x5728;&#x8F66;&#x5B50;&#x5F00;&#x51FA;&#x5B66;&#x6821;&#x6CA1;&#x591A;&#x4E45;&#xFF0C;&#x4E00;&#x4E2A;&#x5927;&#x5B66;&#x540C;&#x5B66;&#xFF08;&#x5973;&#x751F;&#xFF09;&#x8D23;&#x602A;&#x6211;&#x6CA1;&#x6709;&#x53EB;&#x5979;&#x9001;&#x6211;&#x4E00;&#x7A0B;&#xFF0C;&#x751A;&#x81F3;&#x90FD;&#x542C;&#x5230;&#x4E86;&#x5979;&#x5728;&#x7535;&#x8BDD;&#x90A3;&#x5934;&#x7684;&#x555C;&#x6CE3;&#x58F0;&#x97F3;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4E0D;&#x77E5;&#x600E;&#x4E48;&#x7684;&#xFF0C;&#x773C;&#x89D2;&#x4E5F;&#x6709;&#x70B9;&#x6E7F;&#x6DA6;&#x3002;&#x5927;&#x5B66;&#x8BA4;&#x8BC6;&#x4E86;&#x597D;&#x591A;&#x4EBA;&#xFF0C;&#x5927;&#x4E00;&#x5B66;&#x751F;&#x4F1A;&#x5E26;&#x7740;&#x6211;&#x4EEC;&#x7684;&#x7533;&#x6CD5;&#x8D85;&#x5B66;&#x957F;&#x8FD8;&#x6709;&#x4E24;&#x4F4D;&#x53EF;&#x7231;&#x7F8E;&#x4E3D;&#x7684;&#x90E8;&#x95E8;&#x5B66;&#x59D0;&#xFF0C;&#x5728;&#x5927;&#x5B66;&#x671F;&#x95F4;&#x4E00;&#x76F4;&#x6307;&#x5BFC;&#x6211;&#x7684;&#x826F;&#x5E08;&#x76CA;&#x53CB;&#x6F58;&#x6CFD;&#x4E2D;&#x5B66;&#x957F;&#xFF0C;&#x6211;&#x7684;&#x8001;&#x4E61;&#x517C;&#x826F;&#x5E08;&#x5218;&#x51E1;&#x5B66;&#x957F;&#xFF0C;&#x5E26;&#x9886;&#x6211;&#x5165;&#x524D;&#x7AEF;&#x5751;&#x7684;&#x8001;&#x53F8;&#x673A;&#x55BB;&#x5C0F;&#x53F3;&#x5B66;&#x957F;&#xFF08;&#x8C22;&#x8C22;&#x4F60;&#xFF0C;&#x8BA9;&#x6211;&#x7ACB;&#x4E0B;&#x53BB;&#x5927;&#x5382;&#x5DE5;&#x4F5C;&#x7684;&#x68A6;&#xFF09;&#xFF0C;&#x6211;&#x7684;&#x597D;&#x57FA;&#x53CB;&#x4EEC;&#x554A;&#x6DFB;&#x3001;&#x874C;&#x86AA;&#x3001;&#x554A;&#x6797;&#x3001;&#x7206;&#xFF08;&#x6000;&#x5FF5;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x5403;&#x9E21;&#x516C;&#x7172;&#x7684;&#x65E5;&#x5B50;&#xFF09;&#xFF0C;&#x6211;&#x7684;&#x793E;&#x56E2;&#x57FA;&#x53CB;&#x4EEC;&#x5927;&#x91D1;&#x8868;&#x3001;&#x6625;&#x54E5;&#x3001;&#x5947;&#x54E5;&#x3001;&#x9505;&#x8D34;&#x3001;&#x4E54;&#x6CBB;&#x2026;&#xFF08;&#x540D;&#x5B57;&#x592A;&#x591A;&#x5C31;&#x4E0D;&#x4E00;&#x4E00;&#x5217;&#x4E3E;&#xFF0C;&#x611F;&#x8C22;&#x4F60;&#x4EEC;&#x6EE1;&#x6EE1;&#x7684;&#x57FA;&#x60C5;&#xFF01;&#x8BA9;&#x6211;&#x7684;&#x5927;&#x5B66;&#x751F;&#x6D3B;&#x5145;&#x6EE1;&#x4E50;&#x8DA3;&#xFF01;&#xFF09;&#xFF0C;&#x6211;&#x53EF;&#x7231;&#x7684;&#x5BA4;&#x53CB;&#x738B;&#x4E00;&#x5E06;&#x3001;&#x5F6D;&#x9752;&#x660E;&#x3001;&#x66FE;&#x5FB7;&#x5E73;&#xFF08;&#x8C22;&#x8C22;&#x4F60;&#x4EEC;&#x7684;&#x4E0D;&#x6740;&#x4E4B;&#x6069;&#xFF5E;&#x7B11;&#xFF09; 12&#x5C4A;&#x672C;&#x4E13;&#x4E1A;&#x540C;&#x5B66;&#x4EEC;&#x554A;&#x540D;&#x3001;&#x5B50;&#x591C;&#x3001;&#x82E5;&#x51FD;&#x3001;&#x5973;&#x5C4C;&#x3001;&#x5C0F;&#x534E;&#x5B50;&#x3001;&#x9017;&#x3001;&#x76F2;&#x50E7;&#x3001;&#x82E5;&#x671B;&#x3001;kk&#x3001;&#x8001;&#x9F99;&#x3001;&#x53EF;&#x6C57;(&#x4E0D;&#x5217;&#x4E3E;&#x4E86;&#x540D;&#x5B57;&#x5DE8;&#x591A;&#xFF0C;&#x8C22;&#x8C22;&#xFF0C;&#x8C22;&#x8C22;&#x4F60;&#x4EEC;&#x548C;&#x6211;&#x4E00;&#x8D77;&#x5EA6;&#x8FC7;&#x4E86;&#x6700;&#x7F8E;&#x597D;&#x7684;&#x5927;&#x5B66;4&#x5E74;&#xFF01;)&#xFF0C;&#x6211;&#x656C;&#x7231;&#x7684;&#x8001;&#x5E08;&#x9EC4;&#x5FB7;&#x660C;&#x8001;&#x5E08;&#x3001;&#x738B;&#x4F20;&#x4E91;&#x8001;&#x5E08;&#x3001;&#x4F59;&#x7389;&#x534E;&#x8001;&#x5E08;&#x7B49;&#xFF08;&#x8C22;&#x8C22;&#xFF01;&#x8C22;&#x8C22;&#x4F60;&#x4EEC;&#x5FB7;&#x8C06;&#x8C06;&#x6559;&#x5BFC;&#xFF01;&#xFF09;</p>
<h2 id="gong-zuo"><a href="#&#x5DE5;&#x4F5C;" class="headerlink" title="&#x5DE5;&#x4F5C;"></a>&#x5DE5;&#x4F5C; <a href="#gong-zuo" class="header-anchor">#</a></h2><p>&#x5165;&#x804C;&#x732A;&#x573A;&#x5230;&#x4ECA;&#x5929;&#x4E3A;&#x6B62;&#x5DF2;&#x7ECF;&#x6709;&#x534A;&#x5E74;&#x4E86;&#xFF0C;&#x5728;&#x8FD9;&#x534A;&#x5E74;&#x91CC;&#xFF0C;&#x8BA4;&#x8BC6;&#x4E86;&#x65B0;&#x7684;&#x4E00;&#x6279;&#x4EBA;&#xFF0C;&#x8FD9;&#x5176;&#x4E2D;&#x6709;&#x6211;&#x7684;mini&#x9879;&#x76EE;&#x5C0F;&#x7EC4;&#x7684;&#x5404;&#x4F4D;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#xFF0C;&#x6709;&#x90E8;&#x95E8;&#x7684;&#x5404;&#x4F4D;&#x524D;&#x7AEF;&#x9875;&#x9762;&#x4ED4;&#x4EEC;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x671D;&#x6C14;&#x84EC;&#x52C3;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x60F3;&#x5728;&#x4E00;&#x8D77;&#x78B0;&#x649E;&#x7740;&#x3002;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x4E5F;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x4E9B;&#x8F6C;&#x53D8;&#xFF0C;&#x66F4;&#x52A0;&#x7684;&#x8BA4;&#x6E05;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x4EC0;&#x4E48;&#xFF0C;&#x60F3;&#x8981;&#x8FC7;&#x600E;&#x6837;&#x7684;&#x751F;&#x6D3B;&#x3002;</p>
<h2 id="gong-zuo-ri-chang"><a href="#&#x5DE5;&#x4F5C;&#x65E5;&#x5E38;" class="headerlink" title="&#x5DE5;&#x4F5C;&#x65E5;&#x5E38;"></a>&#x5DE5;&#x4F5C;&#x65E5;&#x5E38; <a href="#gong-zuo-ri-chang" class="header-anchor">#</a></h2><p>&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x65E5;&#x5E38;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x662F;&#x8981;&#x8FDB;&#x884C;&#x81EA;&#x6211;&#x6279;&#x8BC4;&#x7684;&#xFF0C;&#x4ECE;&#x5DE5;&#x4F5C;&#x81F3;&#x4ECA;&#x5B8C;&#x6210;&#x4E86;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x671F;&#x95F4;&#x4E5F;&#x8E29;&#x8FC7;&#x4E0D;&#x5C11;&#x5751;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5DF1;&#x4ECE;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#x53D1;&#x73B0;&#x5C31;&#x5C11;&#x4E86;&#x5F88;&#x591A;&#x5B66;&#x751F;&#x65F6;&#x4EE3;&#x7684;&#x5B66;&#x4E60;&#x6FC0;&#x60C5;&#xFF0C;&#x5728;&#x52A0;&#x4E0A;&#x90E8;&#x95E8;&#x52A0;&#x73ED;&#x4E25;&#x91CD;&#x7A7A;&#x95F2;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x53EA;&#x80FD;&#x7559;&#x7ED9;&#x547C;&#x547C;&#x5927;&#x7761;&#x3002;&#x4EE3;&#x7801;&#x5199;&#x7684;&#x4E5F;&#x5C31;&#x90A3;&#x6837;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#x5E76;&#x6CA1;&#x6709;&#x4E0A;&#x591A;&#x5C11;&#x53F0;&#x9636;&#xFF0C;&#x6211;&#x8FD9;&#x662F;&#x8981;&#x6DF1;&#x523B;&#x6279;&#x8BC4;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#xFF0C;&#x8FD9;&#x534A;&#x5E74;&#x6211;&#x662F;&#x628A;&#x65F6;&#x95F4;&#x6D6A;&#x8D39;&#x5728;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#x4E0A;&#x7684;&#x3002;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x8BF4;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x8BF4;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x8BF4;&#x660E;&#x81EA;&#x5DF1;&#x6B63;&#x89C6;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x7F3A;&#x70B9;&#x3002;&#x6211;&#x6DF1;&#x77E5;&#x81EA;&#x5DF1;&#x7684;&#x611A;&#x949D;&#xFF0C;&#x671B;&#x540E;&#x9762;&#x4EE5;&#x52E4;&#x594B;&#x6765;&#x5F25;&#x8865;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x8DB3;&#xFF01;</p>
<h2 id="jie-yu"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED; <a href="#jie-yu" class="header-anchor">#</a></h2><p>&#x5728;&#x521A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x524D;&#x7AEF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5C31;&#x5728;&#x60F3;&#x554A;&#xFF0C;&#x5982;&#x679C;&#x54EA;&#x4E00;&#x5929;&#x6211;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x80FD;&#x591F;&#x8DD1;&#x5728;&#x522B;&#x4EBA;&#x7684;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x90A3;&#x8BE5;&#x662F;&#x591A;&#x4E48;&#x81EA;&#x8C6A;&#x800C;&#x6709;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#xFF01;&#x73B0;&#x5728;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C0F;&#x613F;&#x671B;&#x5E94;&#x8BE5;&#x7B97;&#x662F;&#x8FBE;&#x6210;&#x4E86;&#xFF01;&#x65F6;&#x95F4;&#x603B;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x5F80;&#x524D;&#x8D70;&#xFF0C;&#x4EBA;&#x4E5F;&#x4E0D;&#x80FD;&#x6C38;&#x8FDC;&#x6D3B;&#x5728;&#x8FC7;&#x53BB;&#xFF0C;&#x628A;&#x63E1;&#x4F4F;&#x5F53;&#x4E0B;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5927;&#x65B9;&#x7684;&#x627F;&#x8BA4;&#x81EA;&#x5DF1;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x627F;&#x8BA4;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x5DE5;&#x4F5C;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x8BD5;&#x7740;&#x591A;&#x601D;&#x8003;&#xFF0C;&#x591A;&#x5B9E;&#x8DF5;&#xFF0C;&#x591A;&#x8BB0;&#x5F55;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x70ED;&#x60C5;&#xFF0C;&#x68A6;&#x60F3;&#xFF0C;&#x52E4;&#x594B;&#x7684;coder&#xFF0C;&#x54E6;&#x5BF9;&#x4E86;&#xFF0C;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x4E5F;&#x53EF;&#x4EE5;&#x5B66;&#x5B66;&#x6444;&#x5F71;&#xFF0C;&#x5B66;&#x4E60;&#x5176;&#x4ED6;&#x6240;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x591A;&#x770B;&#x4E00;&#x4E9B;&#x4E66;&#x7C4D;&#x5145;&#x5B9E;&#x81EA;&#x5DF1;&#x3002;2016&#x5E74;&#xFF0C;&#x6BD5;&#x4E1A;&#x4E86;&#xFF0C;&#x7ED3;&#x675F;&#x4E86;&#x4EBA;&#x751F;&#x4E2D;&#x957F;&#x8FBE;18&#x5E74;&#x7684;&#x8BFE;&#x5802;&#x5B66;&#x4E60;&#x751F;&#x6DAF;&#xFF0C;&#x4EE5;&#x540E;&#x7684;&#x8DEF;&#xFF0C;&#x53EA;&#x6709;&#x81EA;&#x5DF1;&#x53BB;&#x8D70;&#xFF0C;&#x518D;&#x4E5F;&#x6CA1;&#x6709;&#x8001;&#x5E08;&#x5728;&#x4E00;&#x65C1;&#x5C0A;&#x5C0A;&#x6559;&#x8BF2;&#xFF0C;&#x6709;&#x7684;&#x53EA;&#x6709;&#x4E00;&#x9897;&#x8C26;&#x5351;&#x4E0D;&#x5351;&#x4E0D;&#x4EA2;&#x4E4B;&#x5FC3;&#xFF0C;&#x4E08;&#x91CF;&#x4EBA;&#x751F;&#x3002;&#x613F;&#xFF0C;&#x52FF;&#x5FD8;&#x521D;&#x5FC3;&#xFF0C;&#x4E0E;&#x541B;&#x5171;&#x52C9;&#xFF01;&#x6700;&#x540E;&#x4E0A;2&#x5F20;&#x56FE;&#x4F5C;&#x4E3A;&#x7EAA;&#x5FF5;<br>&#x516C;&#x53F8;&#x56ED;&#x533A;<br><img title="&#x7F51;&#x6613;" alt="netease" src="http://oiwdpm2o1.bkt.clouddn.com/static/images/netease.jpeg?imageView2/2/w/600"><br>&#x9875;&#x9762;&#x4ED4;&#x4EEC;<br><img title="FED&#x4EEC;" alt="&#x6211;&#x7684;&#x540C;&#x4E8B;&#x4EEC;" src="http://oiwdpm2o1.bkt.clouddn.com/static/images/fed.jpeg?imageView2/2/w/600"></p>
<p>2016&#x5E74;&#x814A;&#x6708;29&#x65E5;&#x4E8E;&#x676D;&#x5DDE;&#x3002;</p>
</div></article></div><div class="paginator clearfix"><a href="/2017/01/08/javascript/react-family-one/" class="prev">上一篇</a><a href="/2016/10/12/javascript/start-React/" class="next">下一篇</a></div><div data-thread-key="/2016/12/29/other/summary-about-2016/" data-title="我的2016" data-url="2016/12/29/other/summary-about-2016/" class="ds-thread"><script type="text/javascript">var duoshuoQuery = {short_name: "simmer"};
(function() {
    var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0] 
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
//- 多说公共JS代码                   </script></div></section><section class="footer"><p><a href="/about/index.html">Simmer</a> | Make it easy.
</p><div id="go-pg-top" style="display: none; opacity: 0.6;" title="返回顶部">TOP</div></section></div></div><script src="/js/jquery-1.11.1.js"></script><script src="/js/common.js"></script><script type="text/javascript">var cnzz_protocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cspan id='cnzz_stat_icon_1257488449' class='cnzz'%3E%3C/span%3E%3Cscript src='" + cnzz_protocol + "s4.cnzz.com/z_stat.php%3Fid%3D1257488449%26show%3Dpic' type='text/javascript'%3E%3C/script%3E"));</script></body></html>