<!DOCTYPE html><html class="no-js"><head><meta charset="utf-8"><title>司马 - Simmer</title><meta name="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1"><link rel="icon" href="/favicon.png"><link rel="stylesheet" href="/css/style.css"><!-- detech broser's env --><script src="/js/modernizr.js" type="text/javascript"></script><meta name="description" content="A Blog Powered By Hexo"></head><body><div class="nav clearfix"><div title="隐藏导航" id="nav-btn" class="nav-guide"><i class="icon nav-icon">&#xe603;</i></div><div class="nav-inner  clearfix"><a href="/" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe606;</div><span>Home</span></div></a><a href="/archives" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe602;</div><span>Archives</span></div></a><a href="/categories" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe604;</div><span>Categorys</span></div></a><a href="/tags" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe601;</div><span>Tags</span></div></a><a href="/about" class="nav-item"><div class="nav-item-inner"><div class="icon">&#xe605;</div><span>About</span></div></a></div></div><div class="wraper"><div class="main"><section class="content"><div class="post"><article class="post-block"><h2 class="post-title"><a href="/2016/04/14/other/interview-netEase/" class="post-title-link">网易2016春季校园招聘－前端工程师之路</a></h2><div class="post-subtitle clearfix"><span class="post-date">2016年4月14日</span><div class="post-tag"><a href="/2016/04/14/other/interview-netEase/"><sapn>interview</sapn><i class="icon">&#xe600;</i></a></div></div><div class="post-content"><p>&#x53C2;&#x52A0;&#x5B8C;&#x7F51;&#x6613;&#x7684;2016&#x6625;&#x5B63;&#x62DB;&#x8058;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;2&#x5929;&#x4E86;&#xFF0C;&#x8D81;&#x7740;&#x8FD8;&#x6CA1;&#x6709;&#x5FD8;&#x8BB0;&#xFF0C;&#x8D76;&#x7D27;&#x8BB0;&#x5F55;&#x4E0B;&#x7684;&#x6211;&#x7684;&#x7B14;&#x8BD5;/&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x3002;</p>
<a id="more"></a>
<h2 id="bei-jing-jiao-dai"><a href="#&#x80CC;&#x666F;&#x4EA4;&#x4EE3;" class="headerlink" title="&#x80CC;&#x666F;&#x4EA4;&#x4EE3;"></a>&#x80CC;&#x666F;&#x4EA4;&#x4EE3; <a href="#bei-jing-jiao-dai" class="header-anchor">#</a></h2><p>&#x901A;&#x8FC7;&#x5FAE;&#x535A;&#x65E0;&#x610F;&#x95F4;&#x77E5;&#x9053;&#x4E86;&#x7F51;&#x6613;2016&#x6625;&#x5B63;&#x62DB;&#x8058;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x6709;&#x9762;&#x5411;2016&#x5C4A;&#x6BD5;&#x4E1A;&#x751F;&#x7684;&#x8865;&#x62DB;&#xFF0C;&#x6000;&#x7740;&#x597D;&#x5947;&#x7684;&#x5FC3;&#x70B9;&#x51FB;<a href="http://campus.163.com/#/campus/0/0/1" target="_blank" rel="external">&#x5B98;&#x7F51;</a> &#x770B;&#x5230;&#x4E86;&#x6709;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x5C97;&#x4F4D;&#x8865;&#x62DB;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x6E20;&#x9053;&#x8981;&#x5230;&#x4E86;&#x5185;&#x63A8;&#x7801;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x59A5;&#x59A5;&#x7684;&#x7B49;&#x5F85;&#x5728;&#x7EBF;&#x7B14;&#x8BD5;&#x5566;&#xFF5E;</p>
<h2 id="bi-shi"><a href="#&#x7B14;&#x8BD5;" class="headerlink" title="&#x7B14;&#x8BD5;"></a>&#x7B14;&#x8BD5; <a href="#bi-shi" class="header-anchor">#</a></h2><p>&#x7B14;&#x8BD5;&#x65F6;&#x95F4;&#xFF1A;3&#x6708;22&#x53F7; 19:00&#xFF5E;21:00<br>&#x6D4B;&#x8BD5;&#x5C97;&#x4F4D;&#xFF1A;&#x6280;&#x672F;&#x7C7B;&#xFF0D;&#x524D;&#x7AEF;&#x5F00;&#x53D1;</p>
<p>&#x7B14;&#x8BD5;&#x9898;&#x578B;&#x5206;&#x4E3A;&#x5355;&#x9009;/&#x591A;&#x9009;/&#x7B97;&#x6CD5;&#x7F16;&#x7A0B;/&#x524D;&#x7AEF;&#x7EFC;&#x5408;&#x9898;&#x7B49;&#xFF0C;&#x8003;&#x5BDF;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x6709;&#xFF1A;</p>
<ul>
<li>css&#x9009;&#x62E9;&#x5668;&#xFF0C;css position &#xFF0C;css flex&#xFF0C;&#x6D6E;&#x52A8;(BFC)</li>
<li>2&#x53C9;&#x6811;&#xFF0C;TCP/IP&#x534F;&#x8BAE;&#xFF0C;http&#x534F;&#x8BAE;&#x53CA;&#x72B6;&#x6001;&#x7801;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7C7B;&#x578B;&#xFF0C;Localstorage, &#x6D4F;&#x89C8;&#x5668;&#x7F13;&#x5B58;</li>
<li>JavaScript&#x95ED;&#x5305;&#xFF0C;this,call/apply/bind&#xFF0C;&#x539F;&#x578B;&#x94FE;&#xFF0C;DOM&#x64CD;&#x4F5C; &#x53D8;&#x91CF;&#x58F0;&#x660E;&#x524D;&#x7F6E;&#x7B49;&#x3002;</li>
<li>&#x5927;&#x9898;&#x5305;&#x62EC; &#x6269;&#x5C55;Object&#x539F;&#x578B;&#x94FE;&#x4E0A;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B9E;&#x73B0;&#x6DF1;&#x5EA6;&#x514B;&#x9686;&#x3002;</li>
<li>&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x529F;&#x80FD;&#x662F;&#x56FE;&#x7247;&#x5F02;&#x6B65;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#x540E;&#x6267;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</li>
<li>&#x7ED9;&#x51FA;&#x8BBE;&#x8BA1;&#x56FE;&#x5B9E;&#x73B0;HTML/CSS/js &#x5B9E;&#x73B0;&#x8868;&#x5355;ajax&#x63D0;&#x4EA4;&#x5E76;&#x5237;&#x65B0;&#x9875;&#x9762;&#x3002;</li>
<li>2&#x9053;&#x7B97;&#x6CD5;&#x7EFC;&#x5408;&#x9898;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x9053;&#x9898;&#x76EE;&#x662F;&#x6392;&#x5E8F;&#x9898;&#xFF0C;&#x4F7F;&#x7528;PHP/C++/C&#x7F16;&#x5199;</li>
</ul>
<p>&#x9664;&#x4E86;&#x7B97;&#x6CD5;&#x7EFC;&#x5408;&#x9898;&#x8DEA;&#x4E86;&#x51E0;&#x4E4E;&#x6CA1;&#x5199;(&#x51E0;&#x4E4E;&#x5FD8;&#x8BB0;&#x4E86;C&#xFF0C;&#x6CA1;&#x5B66;PHP)&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;&#x90FD;&#x5199;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6B64;&#x6B21;&#x7F51;&#x6613;&#x7684;2016&#x6625;&#x62DB;&#x8003;&#x5BDF;&#x7684;&#x70B9;&#x8FD8;&#x662F;&#x86EE;&#x5168;&#x9762;&#x7684;&#xFF0C;&#x4ECE;&#x7B97;&#x6CD5;&#x5230;html&#x5230;css&#x5230;js&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x7B49;&#x3002;</p>
<h2 id="mian-shi"><a href="#&#x9762;&#x8BD5;" class="headerlink" title="&#x9762;&#x8BD5;"></a>&#x9762;&#x8BD5; <a href="#mian-shi" class="header-anchor">#</a></h2><p>&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x56E0;&#x4E3A;&#x7B97;&#x6CD5;&#x7B54;&#x9898;&#x51E0;&#x4E4E;&#x6CA1;&#x5199;&#xFF0C;&#x8FD8;&#x4EE5;&#x4E3A;&#x6B64;&#x6B21;&#x7B14;&#x8BD5;&#x8981;&#x8DEA;&#x4E86;&#x3002;&#x3002;&#x3002;&#x4F46;&#x662F;4&#x6708;7&#x53F7;&#x665A;&#x4E0A;8&#x70B9;45&#x5206;&#x6536;&#x5230;&#x4E86;&#x7F51;&#x6613;&#x53D1;&#x6765;&#x7684;&#x7B14;&#x8BD5;&#x901A;&#x8FC7;&#x77ED;&#x4FE1;&#x548C;&#x90AE;&#x4EF6;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x4E9B;&#x5C0F;&#x6FC0;&#x52A8;&#x7684;&#x3002;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#x9762;&#x8BD5;&#x653B;&#x7565;&#xFF0C;&#x5BF9;&#x4E8E;&#x5916;&#x5730;&#x9762;&#x8BD5;&#x8005;&#x8FD8;&#x62A5;&#x9500;&#x4E00;&#x90E8;&#x5206;&#x8DEF;&#x8D39;&#xFF0C;&#x7B80;&#x76F4;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x7231;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x4E48;&#x4E48;&#x54D2;&#xFF5E;</p>
<p>&#x9762;&#x8BD5;&#x65F6;&#x95F4;&#xFF1A; 4&#x6708;12&#x53F7; 14: 40<br>&#x9762;&#x8BD5;&#x5730;&#x70B9;&#xFF1A;&#x676D;&#x5DDE;&#x5E02;&#x6EE8;&#x6C5F;&#x533A;&#x7F51;&#x5546;&#x8DEF;&#x7F51;&#x6613;(&#x676D;&#x5DDE;)&#x7F51;&#x7EDC;&#x6709;&#x9650;&#x516C;&#x53F8; C&#x697C;1F</p>
<p><img src="http://7vznf6.com1.z0.glb.clouddn.com/IMG_3170.JPG" alt="&#x7F51;&#x6613;&#x5927;&#x95E8;"></p>
<p>&#x53BB;&#x5230;&#x73B0;&#x573A;&#x53D1;&#x73B0;&#xFF0C;&#x524D;&#x7AEF;&#x7ADF;&#x7136;&#x6709;14&#x7EC4;&#xFF0C;&#x987F;&#x65F6;&#x8D76;&#x811A;&#x4E9A;&#x5386;&#x5C71;&#x5927;&#x3002;&#x3002;&#x3002;</p>
<h3 id="yi-mian"><a href="#&#x4E00;&#x9762;" class="headerlink" title="&#x4E00;&#x9762;"></a>&#x4E00;&#x9762; <a href="#yi-mian" class="header-anchor">#</a></h3><p>&#x4E00;&#x4E0A;&#x6765;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x62FF;&#x8D77;&#x6211;&#x7684;&#x7B80;&#x5386;&#x5C31;&#x5F00;&#x59CB;&#x95EE;&#x6211;&#x5173;&#x4E8E;&#x767E;&#x5EA6;&#x524D;&#x7AEF;&#x5B66;&#x9662;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x201C;&#x4E3A;&#x4EC0;&#x4E48;&#x53C2;&#x52A0;&#x4E86;2&#x6B21;&#x767E;&#x5EA6;&#x524D;&#x7AEF;&#x5B66;&#x9662;&#x201D;&#xFF0C;&#x201C;&#x4E00;&#x6B21;&#x662F;&#x53BB;&#x5E74;&#x6625;&#x5B63;&#x73ED;&#xFF0C;&#x4E00;&#x6B21;&#x662F;&#x4ECA;&#x5E74;&#x7684;&#x6625;&#x5B63;&#x73ED;&#xFF0C;&#x8FD8;&#x5728;&#x8FDB;&#x884C;&#x4E2D;&#x201D;&#xFF0C;&#x201C;&#x53C2;&#x52A0;&#x8FD9;&#x4E2A;&#x5B66;&#x9662;&#xFF0C;&#x4F60;&#x5B66;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x201C;&#x6211;&#x5B66;&#x5230;&#x4E86;&#x3002;&#x3002;&#x3002;&#x201D; &#x540E;&#x9762;&#x5C31;&#x662F;&#x8C08;&#x4E86;&#x4E00;&#x4E0B;&#x6211;&#x7684;React-todo&#x9879;&#x76EE;&#xFF0C;&#x95EE;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x7528;gulp&#x3002;&#x540E;&#x9762;&#x5C31;&#x662F;&#x5E38;&#x89C4;&#x7684;&#x4E00;&#x9053;&#x7B80;&#x5355;&#x7684;javascript&#x9898;&#x76EE;&#xFF1A;100&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x4E00;&#x79D2;&#x51CF;1&#xFF0C;&#x51CF;&#x5230;0&#x7684;&#x65F6;&#x5019;&#x505C;&#x6B62;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#x4E00;&#x5F00;&#x59CB;&#x662F;&#x6709;&#x4E9B;&#x61F5;&#x903C;&#x7684;&#xFF0C;&#x7531;&#x4E8E;&#x7D27;&#x5F20;&#x5927;&#x8111;&#x76AE;&#x5C42;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#xFF0C;&#x8FD8;&#x662F;&#x540E;&#x9762;&#x9010;&#x6E10;&#x51B7;&#x9759;&#x4E0B;&#x6765;&#x7136;&#x540E;&#x624D;&#x7B54;&#x51FA;&#x6765;&#x5BF9;&#x3002;</p>
<figure class="highlight js"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div></pre></td><td class="code"><pre><div class="line"><span class="keyword">var</span> clock = <span class="function"><span class="keyword">function</span>(<span class="params">num</span>) </span>{</div><div class="line">    fn = <span class="function"><span class="keyword">function</span>(<span class="params"></span>) </span>{ <span class="comment">// &#x5B9A;&#x4E49;&#x80FD;&#x5F15;&#x7528;&#x5230;num&#x7684;fn&#x51FD;&#x6570;</span></div><div class="line">        <span class="keyword">var</span> time;</div><div class="line">        <span class="keyword">if</span>(num &lt;= <span class="number">0</span>) { <span class="comment">// &#x5982;&#x679C;&#x5012;&#x8BA1;&#x65F6;&#x5230;0</span></div><div class="line">            num = <span class="number">0</span>;</div><div class="line">            <span class="built_in">window</span> &amp;&amp; <span class="built_in">window</span>.clearTimeout(time);</div><div class="line">            <span class="keyword">return</span>; <span class="comment">// &#x8FD4;&#x56DE;</span></div><div class="line">        } <span class="keyword">else</span> {</div><div class="line">            num--; </div><div class="line">            time = <span class="built_in">window</span>.setTimeout(<span class="built_in">arguments</span>.callee, <span class="number">1000</span>); <span class="comment">// &#x9012;&#x5F52;&#x8C03;&#x7528;</span></div><div class="line">        }</div><div class="line">    }</div><div class="line">    fn();</div><div class="line">};</div><div class="line"></div><div class="line">clock(<span class="number">100</span>);</div></pre></td></tr></table></figure>
<p>&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>setInterval</code>&#x6765;&#x5199;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;javascript&#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x4F7F;&#x7528;<code>setInterval</code>&#x53EF;&#x80FD;&#x4F1A;&#x5B58;&#x5728;&#x8C03;&#x7528;&#x4E22;&#x5931;&#xFF0C;&#x800C;<code>setTimeout</code>&#x5C31;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;<br>&#x63A5;&#x4E0B;&#x6765;&#x95EE;&#x7684;&#x662F;&#x5982;&#x4F55;&#x5C01;&#x88C5;&#x4E00;&#x4E2A;&#x5F39;&#x7A97;&#x7EC4;&#x4EF6;&#xFF0C;&#x5B9E;&#x73B0;&#x5F39;&#x7A97;title&#x3001; &#x5185;&#x5BB9;&#x548C;&#x5E95;&#x90E8;&#x6309;&#x94AE;&#x53EF;&#x5B9A;&#x5236;&#x3002;&#x6211;&#x7684;&#x7EC4;&#x4EF6;&#x5C01;&#x88C5;&#x7ECF;&#x9A8C;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x53EF;&#x80FD;&#x7B54;&#x5F97;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x3002;&#x3002;&#x3002;<br>next,&#x95EE;&#x4E86;javascript&#x4E8B;&#x4EF6;&#x3001;&#x95EE;&#x4E86;&#x6211;&#x77E5;&#x4E0D;&#x77E5;&#x9053;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x5F53;&#x7136;&#x77E5;&#x9053;&#xFF0C;CommonJs&#x3001; AMD&#x3001; CMD&#x3001;UMD&#x3002;node&#x7684;<code>require</code>&#x662F;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x524D;&#x7AEF;&#x9875;&#x9762;&#x7684;&#x4E0B;&#x8F7D;&#x5219;&#x9700;&#x8981;&#x5F02;&#x6B65;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x539F;&#x56E0;&#xFF0C;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x5F53;&#x7136;&#x6CA1;&#x6709;&#x540E;&#x7AEF;&#x76F4;&#x63A5;&#x672C;&#x5730;&#x8BFB;&#x533A;&#x901F;&#x5EA6;&#x5FEB;&#x3002;&#x7136;&#x540E;&#x8BF4;&#x4E86;&#x4E00;&#x4E0B;UMD&#x6A21;&#x5757;&#x5C01;&#x88C5;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x63A5;&#x7740;&#x95EE;&#x4E3A;&#x4F55;&#x8981;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x56DE;&#x7B54;&#x662F;&#x4E3A;&#x4E86;js&#x4EE3;&#x7801;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x987A;&#x5E8F;&#x4E0B;&#x8F7D;&#x5E76;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x5229;&#x4E8E;&#x7EF4;&#x62A4;&#x7B49;&#x3002;&#x6700;&#x540E;&#x95EE;&#x4E86;&#x6211;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x524D;&#x7AEF;&#x4F18;&#x5316;&#x65B9;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x56DE;&#x7B54;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x96C5;&#x864E;&#x519B;&#x89C4;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#x9996;&#x5C4F;&#x6E32;&#x67D3;&#xFF0C;&#x56FE;&#x7247;&#x61D2;&#x52A0;&#x8F7D;/&#x9884;&#x52A0;&#x8F7D;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x7F13;&#x5B58;&#xFF0C;SEO&#x4F18;&#x5316;(meta&#x6807;&#x7B7E;)&#xFF0C;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#x3001;&#x4EE3;&#x7801;&#x4F18;&#x5316;(&#x98CE;&#x683C;&#x7EDF;&#x4E00;&#x5565;&#x7684;)&#x3002;</p>
<p>&#x4E00;&#x9762;&#x7684;&#x9762;&#x8BD5;&#x5B98;&#x5C5E;&#x4E8E;&#x90A3;&#x79CD;&#x7ECF;&#x5386;&#x98CE;&#x96E8;&#x7684;&#x4EBA;&#xFF0C;&#x6574;&#x4E2A;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x90FD;&#x9762;&#x65E0;&#x8868;&#x60C5;&#xFF0C;&#x7B80;&#x76F4;&#x5413;&#x5230;&#x4E86;&#x6211;&#x3002;&#x3002;&#x3002;</p>
<h3 id="er-mian"><a href="#&#x4E8C;&#x9762;" class="headerlink" title="&#x4E8C;&#x9762;"></a>&#x4E8C;&#x9762; <a href="#er-mian" class="header-anchor">#</a></h3><p>&#x521A;&#x521A;&#x8D70;&#x51FA;&#x53BB;&#xFF0C;&#x5916;&#x9762;&#x5C31;&#x5728;&#x53EB;&#x6211;&#x540D;&#x5B57;&#x901A;&#x77E5;&#x6211;&#x8FDB;&#x53BB;&#x4E8C;&#x9762;&#x3002;</p>
<p>&#x4E8C;&#x9762;&#x7684;&#x9762;&#x8BD5;&#x5B98;&#x5219;&#x662F;&#x6BD4;&#x8F83;&#x548C;&#x853C;&#x7684;&#x90A3;&#x79CD;&#x4EBA;&#xFF0C;&#x4E0A;&#x6765;&#x5C31;&#x53EB;&#x6211;&#x505A;&#x4E00;&#x4E2A;&#x81EA;&#x6211;&#x4ECB;&#x7ECD;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x804A;&#x6211;&#x7684;&#x5B9E;&#x4E60;&#x7ECF;&#x5386;&#xFF0C;&#x95EE;&#x6211;&#x662F;&#x5982;&#x4F55;&#x9002;&#x914D;&#x4E0D;&#x540C;&#x7684;&#x79FB;&#x52A8;&#x7AEF;&#x5C4F;&#x5E55;&#x7B49;&#x3002;&#x6211;&#x5C31;&#x6252;&#x62C9;&#x6252;&#x62C9;&#x8BF4;&#x4E86;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x4EC0;&#x4E48;&#x901A;&#x8FC7;&#x4F7F;&#x7528;Stylus&#x6A21;&#x5757;&#x5316;CSS&#x4EE3;&#x7801;&#x63D0;&#x5347;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x548C;&#x4EE3;&#x7801;&#x53EF;&#x7EF4;&#x62A4;&#x5EA6;&#x5565;&#x7684;&#x3002;&#x3002;&#x3002;<br>&#x7136;&#x540E;&#x9762;&#x8BD5;&#x5B98;&#x770B;&#x5230;&#x6211;&#x7B80;&#x5386;&#x4E0A;&#x5199;&#x7740;&#x719F;&#x6089;<code>jQuery</code>&#x3001;<code>React</code>&#x7B49;&#x524D;&#x7AEF;&#x5E93;/&#x6846;&#x67B6;&#xFF0C;&#x5C31;&#x95EE;&#x6211;&#x6709;&#x6CA1;&#x6709;&#x8BFB;&#x8FC7;&#x6E90;&#x7801;&#xFF1F;&#x56DE;&#x7B54;&#x8BFB;&#x8FC7;&#x4E00;&#x4E9B;&#xFF0C;<code>jQuery</code>&#x7684;<code>bind</code>&#x8FD8;&#x6709;<code>each</code>&#x65B9;&#x6CD5;&#x5565;&#x7684;&#xFF0C;&#x8FD8;&#x8BF4;&#x4E86;&#x4E00;&#x4E0B;<code>React</code>&#x7684;<code>virtual DOM</code>&#x9AD8;&#x6548;&#x7684;&#x539F;&#x56E0;&#xFF0D;Reat&#x72EC;&#x6709;&#x7684;diff&#x7B97;&#x6CD5;&#xFF0C;&#x5305;&#x62EC;<code>tree diff</code>&#x3001;<code>component diff</code>&#x3001;<code>element diff</code>&#x7B49;&#x3002;&#x5E76;&#x603B;&#x7ED3;&#x4E86;&#x4E00;&#x4E0B;&#x4E86;&#x89E3;&#x6E90;&#x7801;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x7684;&#x53BB;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x9488;&#x5BF9;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x60C5;&#x51B5;&#x53BB;&#x5904;&#x7406;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x524D;&#x7AEF;&#x4EE3;&#x7801;&#x9AD8;&#x6548;&#x7B49;&#x3002;&#x6700;&#x540E;&#x8003;&#x5BDF;&#x4E86;&#x4E00;&#x9053;CSS&#x95ED;&#x5408;&#x6D6E;&#x52A8;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x7B80;&#x5355;&#x7684;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5C31;&#x8BF4;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x53EB;&#x6211;&#x51FA;&#x53BB;&#x7B49;&#x901A;&#x77E5;&#x3002;</p>
<h3 id="hr-mian"><a href="#HR&#x9762;" class="headerlink" title="HR&#x9762;"></a>HR&#x9762; <a href="#hr-mian" class="header-anchor">#</a></h3><p>&#x5728;&#x7B49;HR&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x548C;&#x65C1;&#x8FB9;&#x7684;&#x57FA;&#x53CB;(&#x5927;&#x56DB;)&#x804A;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x7279;&#x610F;&#x4ECE;&#x6B66;&#x6C49;&#x8D76;&#x6765;&#x7684;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x4E3B;&#x8981;&#x505A;&#x4E00;&#x4E9B;node&#x76F8;&#x5173;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x4EBA;&#x8FD8;&#x86EE;&#x597D;&#x7684;&#xFF0C;&#x8C03;&#x4F83;&#x8BF4;&#x5230;&#x65F6;&#x5019;&#x522B;&#x54B1;&#x4E24;&#x90FD;&#x88AB;&#x5F55;&#x53D6;&#x4E86;&#x54C8;&#x54C8;&#x54C8;&#xFF5E;</p>
<p>&#x7B49;&#x4E86;20&#x5206;&#x949F;&#xFF0C;HR&#x9762;&#x8BD5;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x3002;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x5341;&#x5206;&#x878D;&#x6D3D;&#xFF0C;&#x95EE;&#x6211;&#x5728;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x9047;&#x5230;&#x7684;&#x6700;&#x5927;&#x7684;&#x56F0;&#x96BE;&#x662F;&#x4EC0;&#x4E48;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8F9E;&#x53BB;&#x5DE5;&#x4F5C;&#x6765;&#x676D;&#x5DDE;&#x3001; &#x7236;&#x6BCD;&#x652F;&#x6301;&#x6211;&#x4EEC;&#x5DE5;&#x4F5C;&#x4E48;&#x3001;&#x5BF9;&#x4E8E;&#x6211;&#x5E94;&#x8058;&#x7684;&#x90E8;&#x95E8;&#x4E86;&#x89E3;&#x4E48;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x9762;&#x8BD5;&#x5B8C;&#x540E;&#xFF0C;&#x548C;&#x90A3;&#x4E2A;&#x57FA;&#x53CB;&#x804A;&#x4E86;&#x4E00;&#x4F1A;(&#x4ED6;&#x521A;&#x521A;&#x9762;&#x5B8C;&#x4E00;&#x9762;&#xFF0C;&#x8FD8;&#x5728;&#x7B49;&#x4E8C;&#x9762;)&#xFF0C;&#x6211;&#x5C31;&#x548C;&#x4ED6;&#x7EE7;&#x7EED;&#x804A;&#x5929;&#xFF0C;&#x7ED9;&#x4ED6;&#x52A0;&#x6CB9;&#x9F13;&#x52B2;&#xFF5E; &#x540E;&#x9762;&#x56E0;&#x4E3A;&#x8981;&#x8D76;&#x9AD8;&#x94C1;&#x56DE;&#x6765;&#x5C31;&#x63D0;&#x524D;&#x8D70;&#x4E86;&#xFF0C;&#x8D70;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x51FB;&#x638C;&#x4E92;&#x7559;&#x795D;&#x798F;&#xFF5E; &#x6109;&#x5FEB;&#x7684;&#x676D;&#x5DDE;&#x9762;&#x8BD5;&#x4E4B;&#x65C5;&#x7ED3;&#x675F;&#x4E86;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x611F;&#x8C22;&#x81EA;&#x5DF1;&#x7684;&#x575A;&#x6301;&#xFF0C;&#x5E0C;&#x671B;&#x4E00;&#x5207;&#x5B89;&#x597D;!</p>
<h3 id="hou-xu-geng-xin"><a href="#&#x540E;&#x7EED;&#x66F4;&#x65B0;" class="headerlink" title="&#x540E;&#x7EED;&#x66F4;&#x65B0;"></a>&#x540E;&#x7EED;&#x66F4;&#x65B0; <a href="#hou-xu-geng-xin" class="header-anchor">#</a></h3><p>&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x4E86;&#x7F51;&#x6613;&#x7684;offer&#xFF0C;&#x51B3;&#x5B9A;&#x53BB;&#x7F51;&#x6613;&#x4E86;&#x3002;&#x4E00;&#x4E2A;&#x662F;&#x676D;&#x5DDE;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x6211;&#x86EE;&#x559C;&#x6B22;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x6211;&#x4E5F;&#x5411;&#x5F80;&#x5927;&#x516C;&#x53F8;&#x7684;&#x5DE5;&#x4F5C;&#x6C1B;&#x56F4;&#x3002;<br>&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x7684;&#x7F51;&#x6613;!<br>&#x795D;&#x5927;&#x5BB6;&#x7684;&#x4ED8;&#x51FA;&#x90FD;&#x80FD;&#x5F97;&#x5230;&#x56DE;&#x62A5;!&#x6210;&#x529F;&#x7684;&#x4ED8;&#x51FA;&#x79BB;&#x4E0D;&#x5F00;&#x52AA;&#x529B;&#xFF0C;&#x4F46;&#x4E5F;&#x79BB;&#x4E0D;&#x5F00;&#x90A3;&#x4E9B;&#x4E00;&#x76F4;&#x5728;&#x9ED8;&#x9ED8;&#x9F13;&#x52B1;&#x4F60;&#x7684;&#x4EBA;!</p>
</div></article></div><div class="paginator clearfix"><a href="/2016/04/16/other/21Days/" class="prev">上一篇</a><a href="/2016/03/14/javascript/printStar/" class="next">下一篇</a></div><div data-thread-key="/2016/04/14/other/interview-netEase/" data-title="网易2016春季校园招聘－前端工程师之路" data-url="2016/04/14/other/interview-netEase/" class="ds-thread"><script type="text/javascript">var duoshuoQuery = {short_name: "simmer"};
(function() {
    var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0] 
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
//- 多说公共JS代码                   </script></div></section><section class="footer"><p><a href="/about/index.html">Simmer</a> | Make it easy.
</p><div id="go-pg-top" style="display: none; opacity: 0.6;" title="返回顶部">TOP</div></section></div></div><script src="/js/jquery-1.11.1.js"></script><script src="/js/common.js"></script><script type="text/javascript">var cnzz_protocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cspan id='cnzz_stat_icon_1257488449' class='cnzz'%3E%3C/span%3E%3Cscript src='" + cnzz_protocol + "s4.cnzz.com/z_stat.php%3Fid%3D1257488449%26show%3Dpic' type='text/javascript'%3E%3C/script%3E"));</script></body></html>